Revit 2024 API
BumpMap Members
The BumpMap type exposes the following members.
Properties
Name | Description
BumpmapBitmap
 The property labeled "Source" from the "BumpMap" schema.
BumpmapDepth
 The property labeled "Amount" from the "BumpMap" schema.
BumpmapNormalScale
 The property labeled "Amount" from the "BumpMap" schema.
BumpmapType
 The property labeled "Bump Type" from the "BumpMap" schema.
TextureLinkTextureTransforms
 The property labeled "Link Transforms" from the "BumpMap" schema.
TextureOffsetLock
 The property labeled "Offset Lock" from the "BumpMap" schema.
TextureRealWorldOffsetX
 The property labeled "Offset X" from the "BumpMap" schema.
TextureRealWorldOffsetY
 The property labeled "Offset Y" from the "BumpMap" schema.
TextureRealWorldScaleX
 The property labeled "Size X" from the "BumpMap" schema.
TextureRealWorldScaleY
 The property labeled "Size Y" from the "BumpMap" schema.
TextureScaleLock
 The property labeled "Scale Lock" from the "BumpMap" schema.
TextureURepeat
 The property labeled "U Repeat" from the "BumpMap" schema.
TextureVRepeat
 The property labeled "V Repeat" from the "BumpMap" schema.
TextureWAngle
 The property labeled "Angle" from the "BumpMap" schema.
See Also
BumpMap Class
Autodesk.Revit.DB.Visual Namespace